** Tests

I'm aware, we're a bit light on tests, but we started adding some tests. If adding a new feature, please try to add tests.

Tests live under the tests directory:

#+begin_src bash
  ls tests/*tests.el
#+end_src

#+RESULTS:
| tests/agent-shell-anthropic-tests.el |
| tests/agent-shell-tests.el           |

